



Mobile Ad hoc Networks Working Group                           R. Taylor
Internet-Draft                                    Airbus Defence & Space
Intended status: Standards Track                              S. Ratliff
Expires: February 24, 2019                                    VT iDirect
                                                         August 23, 2018


                     DLEP Link Identifier Extension
                 draft-ietf-manet-dlep-lid-extension-04

Abstract

   There exists a class of modems that would benefit from supporting the
   Dynamic Link Exchange Protocol (DLEP) [RFC8175] but do not present a
   single Layer 2 network domain as required by DLEP.  Such devices may
   be:

   o  Modems that maintain a varying link to some upstream backbone
      network infrastructure, where the ability to announce link state
      and DLEP metrics is desired, but the concept of a DLEP destination
      router for the backbone does not apply.  Examples of such devices
      can include LTE modems, IEEE 802.11 stations not in ad-hoc mode,
      and some satellite terminals.

   o  Modems that provide Layer 3 wide area network connectivity between
      devices, where remote DLEP destinations do exist, but are not
      directly reachable by MAC address, such as modems that contain
      embedded routing functionality.

   This document introduces an optional extension to the core DLEP
   specification, allowing DLEP to be used between routers and modems
   that operate in this way.

   Note:

   o  This document is intended as an extension to the core DLEP
      specification, and readers are expected to be fully conversant
      with the operation of core DLEP.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.



Taylor & Ratliff        Expires February 24, 2019               [Page 1]

Internet-Draft       DLEP Link Identifier Extension          August 2018


   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on February 24, 2019.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Requirements  . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Operation . . . . . . . . . . . . . . . . . . . . . . . . . .   3
     2.1.  Identifier Restrictions . . . . . . . . . . . . . . . . .   4
     2.2.  Negotiation . . . . . . . . . . . . . . . . . . . . . . .   5
   3.  New Data Items  . . . . . . . . . . . . . . . . . . . . . . .   5
     3.1.  Link Identifier Length Data Item  . . . . . . . . . . . .   5
     3.2.  Link Identifier Data Item . . . . . . . . . . . . . . . .   6
   4.  Security Considerations . . . . . . . . . . . . . . . . . . .   6
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7
   6.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7
     6.1.  Normative References  . . . . . . . . . . . . . . . . . .   7
     6.2.  Informative References  . . . . . . . . . . . . . . . . .   7
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   7

1.  Introduction

   The Dynamic Link Exchange Protocol (DLEP) [RFC8175] describes a
   protocol for modems to advertise the status of wireless links between
   reachable destinations to attached routers.  The core specification
   of the protocol assumes that every modem in the radio network has an
   attached DLEP router, and requires that the MAC address of the DLEP
   interface on the attached router is used to identify the destination




Taylor & Ratliff        Expires February 24, 2019               [Page 2]

Internet-Draft       DLEP Link Identifier Extension          August 2018


   in the network for purposes of reporting the state and quality of the
   link to that destination.

   This document describes a DLEP Extension allowing modems that do not
   meet the strict requirement that DLEP must be implemented on a single
   Layer 2 domain to use DLEP to describe link availability and quality
   to one or more destinations reachable beyond a local or remote device
   on the Layer 2 domain.  A router can use this knowledge to influence
   any routing or flow-control decisions regarding traffic to this
   destination, understanding that such traffic flows via Layer 3.

   A Layer 3 destination may be an attached DLEP router, in the case of
   a modem that provides Layer 3 wide area network connectivity between
   devices, or a logical destination that describes a set of attached
   subnets, when referring to some upstream backbone network
   infrastructure.

1.1.  Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14, RFC 2119.

2.  Operation

   To refer to a Layer 3 DLEP Destination, the DLEP session participant
   adds a Link Identifier Data Item (Section 3.2) to the relevant
   Destination Message, and (as usual) includes a MAC Address Data Item.
   When paired with a Link Identifier Data Item, the MAC Address Data
   Item MUST contain the MAC address of the last reachable node in the
   Layer 2 domain beyond which the Layer 3 DLEP Destination resides.
   For example, if the over-the-air network is not a single Layer 2
   domain, the MAC Address Data Item might be the address of the LAN-
   side interface of the local modem.  Alternatively, when used with
   some kind of backbone infrastructure, the MAC Address Data Item would
   be the address of the last device reachable on the local Layer 2
   domain.  However, how such remote destinations are discovered is
   beyond the scope of this specification.

   As only modems are initially aware of Layer 3 DLEP Destinations, Link
   Identifier Data Items referring to a new link MUST first appear in a
   DLEP Destination Up Message from the modem to the router.  Once a
   link has been identified in this way, Link Identifier Data Items MAY
   be used by either DLEP participant during the lifetime of a DLEP
   session.  Because of this, a router MUST NOT send a DLEP Destination
   Announce Message containing a Link Identifier Data Item referring to
   a link that has not been mentioned in a prior DLEP Destination Up
   Message.



Taylor & Ratliff        Expires February 24, 2019               [Page 3]

Internet-Draft       DLEP Link Identifier Extension          August 2018


   Because the MAC Address associated with any DLEP Destination Message
   containing a Link Identifier Data Item is not the Layer 2 address of
   the destination, all DLEP Destination Up Messages MUST contain Layer
   3 information.  In the case of modems that provide Layer 3 wide area
   network connectivity between devices, this means one or more IPv4 or
   IPv6 Address Data Items providing the Layer 3 address of the
   destination.  When referring to some upstream backbone network
   infrastructure, this means one or more IPv4 or IPv6 Attached Subnet
   Data Items, for example: '0.0.0.0/0' or '::/0'.  This allows the DLEP
   peer router to understand the properties of the link to those routes.

   When the DLEP peer router wishes to forward packets to the Layer 3
   destination or subnet, the MAC address associated with the link MUST
   be used as the Layer 2 destination of the packet if it wishes to use
   the modem network to forward the packet.

   As most mainstream routers expect to populate their routing
   information base with the IP address of the next router towards a
   destination, implementations supporting this extension SHOULD
   announce one or more valid IPv4 or IPv6 addresses of the last
   reachable Layer 2 device, i.e. the device with the corresponding MAC
   Address.

   If the last reachable Layer 2 device is not the DLEP peer modem, then
   the modem SHOULD announce a DLEP Destination with the required MAC
   Address without including a Link Identifier Data Item.

2.1.  Identifier Restrictions

   A Link Identifier is by default 4 octets in length.  If a modem
   wishes to use a Link Identifier of a different length, it MUST be
   announced using the Link Identifier Length Data Item (Section 3.1)
   contained in the DLEP Session Initialization Response message sent by
   the modem to the router.

   During the lifetime of a DLEP session, the length of Link Identifiers
   MUST remain constant, i.e. the Length field of the Link Identifier
   Data Item MUST NOT differ between destinations.

   The method for generating Link Identifiers is a modem implementation
   matter and out of scope of this document.  Routers MUST NOT make any
   assumptions about the meaning of Link Identifiers, or how Link
   Identifiers are generated.

   Within a single DLEP session, all Link Identifiers MUST be unique per
   MAC Address.  This means that a Layer 3 DLEP Destination is uniquely
   identified by the pair: {MAC Address,Link Identifier}.




Taylor & Ratliff        Expires February 24, 2019               [Page 4]

Internet-Draft       DLEP Link Identifier Extension          August 2018


   Link Identifiers MUST NOT be reused, i.e. a {MAC Address,Link
   Identifier} pair that has been used to refer to one DLEP Destination
   MUST NOT be recycled to refer to a different destination within the
   lifetime of a single DLEP session.

2.2.  Negotiation

   To use this extension, as with all DLEP extensions, the extension
   MUST be announced during DLEP session initialization.  A router
   advertises support by including the value 'Link Identifiers' (TBD1),
   Section 5, in the Extension Data Item within the Session
   Initialization Message.  A modem advertises support by including the
   value 'Link Identifiers' (TBD1) in the Extension Data Item within the
   Session Initialization Response Message.  If both DLEP peers
   advertise support for this extension then the Link Identifier Data
   Item MAY be used.

   If a modem requires support for this extension in order to describe
   destinations, and the router does not advertise support, then the
   modem MUST NOT include a Link Identifier Data Item in any DLEP
   Message.  However, the modem SHOULD NOT immediately terminate the
   DLEP session, rather it SHOULD use session-wide DLEP Data Items to
   announce general information about all reachable destinations via the
   modem.  By doing this, a modem allows a router not supporting this
   extension to at least make a best guess at the state of any reachable
   network.  A modem MUST NOT attempt to re-use the MAC Address Data
   Item to perform some kind of sleight-of-hand, assuming that the
   router will notice the DLEP Peer Type of the modem is special in some
   way.

3.  New Data Items

   This extension introduces two new DLEP Data Items: the Link
   Identifier Data Item (Section 3.2) used to identify a Layer 3 link at
   or beyond a destination, and the Link Identifier Length Data Item
   (Section 3.1) used to announce the length of Link Identifiers at
   session initialization.

3.1.  Link Identifier Length Data Item

   The Link Identifier Length Data Item is used by a DLEP modem
   implementation to specify the length of Link Identifier Data Items.
   It MUST be used if the specified length is not the default value of 4
   octets.

   The Link Identifier Length Data Item MAY be used during Session
   Initialization, contained in a Session Initialization Response
   Message.



Taylor & Ratliff        Expires February 24, 2019               [Page 5]

Internet-Draft       DLEP Link Identifier Extension          August 2018


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type                | Length                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Link Identifier Length        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD2, Section 5

   Length:  2

   Link Identifier Length:  The length, in octets, of Link Identifiers
      used by the DLEP modem for this session.

3.2.  Link Identifier Data Item

   The Link Identifier Data Item MAY be used wherever a MAC Address Data
   Item is defined as usable in core DLEP.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type                | Length                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Link Identifier...                          :
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD3, Section 5

   Length:  The length of the Data Item, by default 4, but may be
      different if a Link Identifier Length Data Item (Section 3.1) has
      been announced during session initialization.

   Link Identifier:  The unique identifier of the Layer 3 destination.
      This Link Identifier has no implicit meaning and is only used to
      discriminate between multiple links.

4.  Security Considerations

   As an extension to the core DLEP protocol, the security
   considerations of that protocol apply to this extension.  This
   extension adds no additional security mechanisms or features.

   None of the features introduced by this extension require extra
   consideration by an implementation.





Taylor & Ratliff        Expires February 24, 2019               [Page 6]

Internet-Draft       DLEP Link Identifier Extension          August 2018


5.  IANA Considerations

   Upon approval of this document, IANA is requested to:

   o  Assign a new DLEP Extensions Registry value (TBD1) from the
      Specification Required section, named "Link Identifiers".

   o  Assign a new DLEP Data Item Type Values Registry value (TBD2) from
      the Specification Required section, named "Link Identifier
      Length".

   o  Assign a new DLEP Data Item Type Values Registry value (TBD3) from
      the Specification Required section, named "Link Identifier".

6.  References

6.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC8175]  Ratliff, S., Jury, S., Satterwhite, D., Taylor, R., and B.
              Berry, "Dynamic Link Exchange Protocol (DLEP)", RFC 8175,
              DOI 10.17487/RFC8175, June 2017,
              <https://www.rfc-editor.org/info/rfc8175>.

6.2.  Informative References

   [RFC5226]  Narten, T. and H. Alvestrand, "Guidelines for Writing an
              IANA Considerations Section in RFCs", RFC 5226,
              DOI 10.17487/RFC5226, May 2008,
              <https://www.rfc-editor.org/info/rfc5226>.

Authors' Addresses

   Rick Taylor
   Airbus Defence & Space
   Quadrant House
   Celtic Springs
   Coedkernew
   Newport  NP10 8FZ
   UK

   Email: rick.taylor@airbus.com





Taylor & Ratliff        Expires February 24, 2019               [Page 7]

Internet-Draft       DLEP Link Identifier Extension          August 2018


   Stan Ratliff
   VT iDirect
   13861 Sunrise Valley Drive, Suite 300
   Herndon, VA  20171
   USA

   Email: sratliff@idirect.net












































Taylor & Ratliff        Expires February 24, 2019               [Page 8]
